posts/cold-blooded-comedy-blasphemy/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Cold blooded comedy blasphemy | mindtoilet</title>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono%7CLibre+Baskerville%7CMontserrat%7CPlayfair+Display">
<link rel="stylesheet" href="../../assets/css/libretto_styles.css">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
            <h1 class="site-title">
                <a href="https://mindtoilet.github.io/" title="mindtoilet" rel="home">mindtoilet</a>
            </h1>
        </div>
        <nav class="site-navigation" role="navigation"><div class="menu-toggle">
                <span class="mobile-site-title">mindtoilet</span>
            </div>
            <ul class="menu">
<li><a href="../../archive.html">Archive</a></li>
                    <li><a href="../../categories/">Tags</a></li>
                    <li><a href="../../rss.xml">RSS feed</a></li>
            </ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
        <div class="entry-meta">
            <span class="posted-on">
                Posted on <a href="." rel="bookmark">19-3-2018</a>
            </span>
        </div>
        <h1>Cold blooded comedy blasphemy</h1>
    </div>

        <!-- Page Content -->
    <div class="site-content" role="main">
        <article class="format-standard libretto-long-form"><div class="entry-content">
                <div id="outline-container-orga41df6a" class="outline-2">
<h2 id="orga41df6a">THE PERSONS OF THE PLAY</h2>
<div class="outline-text-2" id="text-orga41df6a">
<p>
<b>Mr. Earnest</b>, a Movie Director.<br></p>

<p>
<b>Mrs. Annamma</b>, Movie Director's assistant.<br></p>

<p>
<b>Parthaa</b>, the Driver<br></p>
</div>
</div>

<div id="outline-container-orgd8d2a61" class="outline-2">
<h2 id="orgd8d2a61">THE SCENES OF THE PLAY</h2>
<div class="outline-text-2" id="text-orgd8d2a61">
<p>
<b>Act I</b>. <i>Inside the car parked outside the movie theatre</i><br></p>

<p>
<b>Act II</b>. <i>Outside the car parked outside the movie theatre</i><br></p>

<p>
<b>Time</b>:  Undefined.<br><b>Place</b>: Unknown.<br></p>
</div>
</div>

<div id="outline-container-org2881332" class="outline-2">
<h2 id="org2881332">FIRST ACT</h2>
<div class="outline-text-2" id="text-org2881332">
<p>
<b>SCENE</b><br><code>Inside the car parked outside the movie theatre.</code><br></p>
<hr>
<p>
[The Director is waiting inside the car.]<br></p>

<p>
[Enter Mrs. Annamma]<br></p>

<p>
<i>ANNAMMA</i>. Earnest, my dear, they are not laughing.<br></p>

<p>
<i>EARNEST</i>. What do you mean they aren't laughing? Did you hear them not laughing?<br></p>

<p>
<i>ANNAMMA</i>. Yes.<br></p>

<p>
<i>EARNEST</i>. It is a comedy movie.<br></p>

<p>
<i>ANNAMMA</i>. I know. But there is no laughter. Humour is hiding.<br></p>

<p>
<i>EARNEST</i>. Ridiculous, ridiculous. The script was hilarious. I wrote it.<br></p>

<p>
<i>ANNAMMA</i>. They are just silent. There is a powerful sound vacuum.<br></p>

<p>
<i>EARNEST</i>. That's impossible. I remember it was funny. Didn't it tickle your funny bone?<br></p>

<p>
<i>ANNAMMA</i>. Yes. It did tickle me.<br></p>

<p>
<i>EARNEST</i>. The actors also were hysterical during the filming. They had the time of their life doing what I told them to do.<br></p>

<p>
<i>ANNAMMA</i>. Right Sir. They did laugh their bottoms up.<br></p>

<p>
<i>EARNEST</i>. Why are the audience such cretins?<br></p>

<p>
<i>ANNAMMA</i>. I don't know. But some of them even left the theatre in between the show.<br></p>

<p>
<i>EARNEST</i>. That's cold blooded comedy blasphemy!<br></p>

<p>
<i>ANNAMMA</i>. I couldn't take it as well. That's why I came out to tell you.<br></p>

<p>
<i>EARNEST</i>. Thanks Annamma. Let's get out of here. Where is our driver?<br></p>

<p>
<i>ANNAMMA</i>. I think he inside the hall watching the movie.<br></p>

<p>
<i>EARNEST</i>. Thank goodness, at least the boy has some sense of humour.<br></p>

<p>
<i>ANNAMMA</i>. Here he comes. In his face, I see… satisfaction!<br></p>

<p>
<i>EARNEST</i>. Wonderful, Wonderful!<br></p>
</div>
</div>
<div id="outline-container-org53caf6e" class="outline-2">
<h2 id="org53caf6e">SECOND ACT</h2>
<div class="outline-text-2" id="text-org53caf6e">
<p>
<b>SCENE</b><br><code>Outside the car parked outside the movie theatre.</code><br></p>
<hr>
<p>
[The Director and Assistant gets out of the car.]<br></p>

<p>
[Enter Parthaa]<br></p>


<p>
<i>EARNEST</i>. Partha, Did you enjoy it?<br></p>

<p>
<i>PARTHAA</i>. Sir, it is Parthaa, not Partha.<br></p>

<p>
<i>EARNEST</i>. Parthaa, Did you enjoy it?<br></p>

<p>
<i>ANNAMMA</i>. Tell us, how was it?<br></p>

<p>
<i>PARTHAA</i>. It was relaxing. Thanks for asking.<br></p>

<p>
<i>EARNEST</i>. Thank God. All that not in vain.<br></p>

<p>
<i>ANNAMMA</i>. Well done Earnest. Congratulations.<br></p>

<p>
<i>EARNEST</i>. Thanks dear.<br></p>

<p>
<i>ANNAMMA</i>. Parthaa, is it over already? I thought it went for another 30 minutes.<br></p>

<p>
<i>PARTHAA</i>. Sorry what? No, I finished it quickly.<br></p>

<p>
<i>ANNAMMA</i>. (exchanging look with Earnest) You finished it quickly…?<br></p>

<p>
<i>EARNEST</i>. Were you not in the theatre?<br></p>

<p>
<i>ANNAMMA</i>. Watching the movie?<br></p>

<p>
<i>PARTHAA</i>. Oh, no.. no.. I was in the toilet.<br></p>

<hr>
<hr>
<p>
<i>Kindly leave your feedback <a href="https://twitter.com/mind_toilet/status/1308330342948827139?s=20">here</a>.</i><br></p>
<hr>
</div>
</div>
            </div>
        </article>
</div>

        <!-- Tag Section -->
    <div class="site-content navigation-post">
        <div class="tag-head">Tags</div>
        <div class="tag-list">
                <a href="../../categories/comedy/">comedy</a>
                    <span>  </span>
                <a href="../../categories/humour/">humour</a>
                    <span>  </span>
                <a href="../../categories/movies/">movies</a>
        </div>
    </div>

        <!-- Post Navigation links -->
<nav class="site-content navigation-post" role="navigation"><div class="previous">
            <a href="../i-am-not-from-hitherto/" rel="prev">
                <span class="meta-nav">Older Post</span>I am not from hitherto
            </a>
        </div>
        <div class="next">
            <a href="../today-is-wednesday/" rel="next">
                <span class="meta-nav">Newer Post</span>Today is Wednesday
            </a>
        </div>
</nav><!-- Page Footer --><section class="footer-sidebar clear" role="complementary"><div class="widget-block">
            <aside class="widget"><h2 class="widget-title">mindtoilet</h2>
                <div class="widget-text">Mind Blogging</div>
            </aside>
</div>
    </section><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
            <p>Contents © 2020         <a href="mailto:mindtoilet@gmail.com">mind</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            <p>Powered by <a href="https://getnikola.com/">Nikola</a> using the <a href="https://note2self.abraham-v.com/libretto-theme-for-nikola/">Libretto theme</a>.</p>
        </div>
        <div class="social">
            <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>
